In [1]:
import matplotlib.pyplot as plt 
import pandas as pd
import numpy as np
# import sklearn

In [2]:
dataset=pd.read_csv('Titanic-Dataset.csv')

In [3]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
dataset=dataset.drop(columns=['PassengerId','Cabin','Pclass','Name','Ticket'])

In [5]:
dataset.head()

   Survived     Sex   Age  SibSp  Parch     Fare Embarked
0         0    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         1  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         0    male  35.0      0      0   8.0500        S

In [6]:
dataset.isnull().sum()

Survived      0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [7]:
median=dataset['Age'].median()
Max=dataset['Embarked'].value_counts().idxmax()
print(Max)
dataset['Age']=dataset['Age'].fillna(median)
dataset['Sex'] = dataset['Sex'].map({'male': 0, 'female': 1})
dataset['Embarked'] = dataset['Embarked'].fillna(Max)
dataset.isnull().sum()

S

Survived    0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [8]:
dataset.head()

   Survived  Sex   Age  SibSp  Parch     Fare Embarked
0         0    0  22.0      1      0   7.2500        S
1         1    1  38.0      1      0  71.2833        C
2         1    1  26.0      0      0   7.9250        S
3         1    1  35.0      1      0  53.1000        S
4         0    0  35.0      0      0   8.0500        S

In [9]:
dataset = pd.get_dummies(dataset,columns=['Embarked'],drop_first=True)

In [10]:
dataset.head()

   Survived  Sex   Age  SibSp  Parch     Fare  Embarked_Q  Embarked_S
0         0    0  22.0      1      0   7.2500           0           1
1         1    1  38.0      1      0  71.2833           0           0
2         1    1  26.0      0      0   7.9250           0           1
3         1    1  35.0      1      0  53.1000           0           1
4         0    0  35.0      0      0   8.0500           0           1

In [11]:
dataset['Embarked_Q']=np.where((dataset['Embarked_Q']==True),1,0)
dataset['Embarked_S']=np.where((dataset['Embarked_S']==True),1,0)

In [12]:
dataset.head()
dataset.shape

(891, 8)

In [13]:
x= dataset.iloc[:,:-1]
y = dataset.iloc[:,-1]

In [14]:
x.shape

(891, 7)

In [15]:
x_train=dataset.iloc[:713, :-1]
y_train = dataset.iloc[:713, -1]
x_test = dataset.iloc[713:, :-1]
y_test = dataset.iloc[713:, -1]

In [16]:
x_train=np.array(x_train)
y_train=np.array(y_train)
x_test=np.array(x_test)
y_test=np.array(y_test)
x_train.shape, y_train.shape, y_test.shape, x_test.shape

y_train=y_train.reshape((-1,1))
y_train.shape

(713, 1)

In [17]:
def sigmoid(x):
    return 1/(1 + np.exp(-x))

In [18]:
def hypothesis(X, theta):
    return 1/(1 + np.exp(-(np.dot(X, theta))))

In [19]:

def cost(X, Y, theta):
    
    y_p = hypothesis(X, theta)
    
    loss = -1*(np.mean(Y*np.log(y_p) + (1- Y)*np.log(1 - y_p)))
    
    return loss

In [20]:
def gradient(X, Y, theta):
    
    y_p = hypothesis(X, theta)
    
    grad = np.dot(X.T , (Y - y_p))
    
    return grad/X.shape[0]

In [21]:
def gradient_descent(X, Y, learning_rate = 0.3, epochs =89):
    
    m,n = X.shape
    
    theta = np.zeros((n , 1))
    print(theta.shape)
    cost_epoch = []
    
    for i in range(epochs):
        
        print('The algo is on epoch no : ',i, end = '\r')
        
        loss = cost(X, Y, theta)
        
        grad = gradient(X, Y, theta)
        
        cost_epoch.append(loss)
        
        theta = theta + learning_rate*grad
        
    print(grad.shape, theta.shape)
    return theta, cost_epoch

In [22]:
theta, cost = gradient_descent(x_train, y_train, learning_rate=0.0003,epochs = 90000)

(7, 1)
(7, 1) (7, 1)

In [23]:
theta

array([[-0.06795576],
       [-0.06967375],
       [ 0.03234377],
       [ 0.2831735 ],
       [ 0.30114904],
       [-0.00846786],
       [-0.51648364]])

In [24]:
y_test = y_test.reshape((-1, 1))

In [25]:
y_test.shape

(178, 1)

In [26]:
def predict(X, theta):
    
    y_p = hypothesis(X, theta)
    
    y_pred = []

    for i in y_p:
        
        if i >= 0.5:
            y_pred.append(1)
            
        else:
            y_pred.append(0)
    y_pred = np.array(y_pred)        
    
    return y_pred

In [27]:
pred = predict(x_test, theta)

In [28]:
pred = pred.reshape((-1, 1))

In [29]:
pred.shape

(178, 1)

In [30]:
def accuracy(pred, label):
    
    temp = 0
    
    for i in range(pred.shape[0]):
        if pred[i]==label[i]:
            
            temp += 1
        else:
            pass
    print("Accuracy = ", (temp/pred.shape[0])*100, "%")

In [31]:
accuracy(pred, y_test)

Accuracy =  75.84269662921348 %

In [32]:
predict(([1,38.0,1,0,71.2833,0,1]),theta)

array([1])